results/result_grizzly.log
========================================================== 
 
====================WARM-UP======================== 
============So 1. Jan 20:26:13 CET 2017 Warming up the API with 100000 requests
 
starting benchmark...
spawning thread #0: 1 total client(s). 100000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 18.00s, 5264.33 req/s, 2.64MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 50.06MB (52494997) total, 7.44MB (7805835) headers (space savings 0.00%), 39.86MB (41800000) data
                     min         max         mean         sd        +/- sd
time for request:       78us    540.10ms       188us      1.74ms    99.48%
time for connect:       73us        73us        73us         0us   100.00%
time to 1st byte:      383us       383us       383us         0us   100.00%
req/s           :    5264.36     5264.36     5264.36        0.00   100.00%
 
============So 1. Jan 20:26:32 CET 2017 API warmed up. 
 
====================END WARM-UP======================== 
=== Sleeping for 2s
====================BENCHMARK======================== 
============So 1. Jan 20:26:34 CET 2017 Running load test ...
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
spawning thread #2: 8 total client(s). 25000 total requests
spawning thread #3: 8 total client(s). 25000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 5.18s, 19293.63 req/s, 9.66MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 50.07MB (52497632) total, 7.44MB (7805760) headers (space savings 0.00%), 39.86MB (41800000) data
                     min         max         mean         sd        +/- sd
time for request:       89us     42.38ms      1.55ms      2.23ms    91.79%
time for connect:       61us       379us       115us        74us    87.50%
time to 1st byte:      315us     11.69ms      2.52ms      3.13ms    87.50%
req/s           :     603.07      770.03      645.65       41.11    75.00%
 
============So 1. Jan 20:26:39 CET 2017 Done ...
 
====================END BENCHMARK========================