results/result_node.log
 
========================================================== 
 
====================WARM-UP======================== 
============Sat Nov 19 10:19:57 CET 2016 Warming up the API with 100000 requests
 
starting benchmark...
spawning thread #0: 1 total client(s). 100000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 9.66s, 10347.58 req/s, 6.46MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 62.47MB (65500000) total, 9.35MB (9800000) headers (space savings 0.00%), 49.78MB (52200000) data
                     min         max         mean         sd        +/- sd
time for request:       78us     15.65ms        95us        68us    98.35%
time for connect:      144us       144us       144us         0us   100.00%
time to 1st byte:    15.79ms     15.79ms     15.79ms         0us   100.00%
req/s           :   10347.79    10347.79    10347.79        0.00   100.00%
 
============Sat Nov 19 10:20:06 CET 2016 API warmed up. 
 
====================END WARM-UP======================== 
=== Sleeping for 2s
====================BENCHMARK======================== 
============Sat Nov 19 10:20:08 CET 2016 Running load test ...
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
spawning thread #2: 8 total client(s). 25000 total requests
spawning thread #3: 8 total client(s). 25000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 9.08s, 11012.78 req/s, 6.88MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 62.47MB (65500000) total, 9.35MB (9800000) headers (space savings 0.00%), 49.78MB (52200000) data
                     min         max         mean         sd        +/- sd
time for request:      204us     18.81ms      2.90ms       429us    98.19%
time for connect:       89us      1.14ms       539us       259us    59.38%
time to 1st byte:    10.89ms     19.02ms     15.23ms      2.07ms    65.63%
req/s           :     344.26      344.44      344.41        0.05    84.38%
 
============Sat Nov 19 10:20:17 CET 2016 Done ...
 
====================END BENCHMARK========================